app/controllers/authors_controller.rb

INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Scott', 'Raymond', '2016-04-01 15:06:42', '2016-04-01 15:06:42')
---
  def create
    @author = Author.new(author_params)
    if @author.save

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
UPDATE `authors` SET `last_name` = 'Bonnehead', `updated_at` = '2016-04-01 20:33:59' WHERE `authors`.`id` = 4
---
  def update
    @author = Author.find(params[:id])

    @author.update(author_params)

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
---
  def edit
    @author = Author.find(params[:id])

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 4
---
  def destroy
    @author = Author.find(params[:id])

    @author.destroy

SELECT `authors`.* FROM `authors`
---
  def index
    @authors = Author.all