app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `isbn`, `price`, `buy`, `format`, `excerpt`, `pages`, `created_at`, `updated_at`) VALUES ('Ajax On Rails', 1, 1, 1, '0596527446', '$7.96', 'http://www.ebay.com/itm/Ajax-on-Rails-Raymond-Scott-OReilly-Media-2007-01-10-Very-Good-Paperback-/331797297609?hash=item4d40a8f9c9:g:hR4AAOSwl9BWIVYz', 'Paperback', 'Nam mollis sapien urna, vitae condimentum mi commodo rutrum. Suspendisse tempor mauris eu consequat ullamcorper. Fusce pharetra, turpis et finibus convallis, nisi purus mattis mauris, sed cursus justo neque eu nisi. Aenean non nisl non ligula pharetra fringilla a at odio. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec ullamcorper posuere placerat. Fusce sapien nisi, consectetur eu pellentesque et, pretium a augue. Sed venenatis diam augue, et pretium tellus suscipit ut. Praesent in arcu et risus tempor aliquam nec non urna. Praesent placerat nec eros sed dictum. Maecenas vestibulum dignissim felis, a dapibus metus aliquet quis. Etiam id massa dolor. Nunc vel ornare ante. ', 495, '2016-04-01 16:28:30', '2016-04-01 16:28:30')
---
  def create
    @book = Book.new(book_params)
    @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `excerpt` = 'Nam mollis sapien urna, vitae condimentum mi commodo rutrum. Suspendisse tempor mauris eu consequat ullamcorper. Fusce pharetra, turpis et finibus convallis, nisi purus mattis mauris, sed cursus justo neque eu nisi. Aenean non nisl non ligula pharetra fringilla a at odio. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec ullamcorper posuere placerat. Fusce sapien nisi, consectetur eu pellentesque et, pretium a augue. Sed venenatis diam augue, et pretium tellus suscipit ut. Praesent in arcu et risus tempor aliquam nec non urna. Praesent placerat nec eros sed dictum. Maecenas vestibulum dignissim felis, a dapibus metus aliquet quis. ', `updated_at` = '2016-04-01 19:47:47' WHERE `books`.`id` = 1
---
  def update
    @book = Book.find(params[:id])

    @book.update(book_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 4
---
  def destroy
    @book = Book.find(params[:id])

    @book.destroy

SELECT `books`.* FROM `books`
SELECT `categories`.* FROM `categories`
---
  def index
    @books = Book.all
    @categories = Category.all

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
---
  def show
    @book = Book.find(params[:id])
    @categories = Category.all