app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('HTML5', '2016-04-01 15:00:43', '2016-04-01 15:00:43')

  def update
    @category = Category.find(params[:id])

    @category.update(category_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Ruby On Rails', `updated_at` = '2016-04-01 20:16:45' WHERE `categories`.`id` = 1

  def destroy
    @category = Category.find(params[:id])

    @category.destroy
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 4 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 4

  def show
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`